SH1_vct0.2/0/magU

FoamFile
{
    version     3.0;
    format      ascii;
    class       volScalarField;
    object      magU;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform     50;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform 50;
    }
    backWall
    {
        type        calculated;
        value       uniform 0;
    }
    sides
    {
        type        empty;
    }
}
