SH1_vct0.2/system/setFieldsDict

FoamFile
{
    version     3.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

defaultFieldValues
(
    volVectorFieldValue U (50 0 0)
    volScalarFieldValue T 773
    volScalarFieldValue p 1.8e7
);

regions
(
    boxToCell
    {
        box (0 -0.5 -0.5) (1250 0.5 0.5);
        fieldValues
        (
            volVectorFieldValue U (50 0 0)
            volScalarFieldValue T 773
            volScalarFieldValue p 1.8e7
        );
    }
);

